manu897/Project-Carl/firmware/node-camera/sdkconfig.defaults
# Defaults for the camera node — applied when sdkconfig is regenerated.
# Edit interactively with: idf.py menuconfig

# --- Target chip ---
CONFIG_IDF_TARGET="esp32s3"

# --- PSRAM (XIAO ESP32-S3 Sense has 8 MB octal PSRAM) ---
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_ESP32S3_DEFAULT_CPU_FREQ_240=y

# --- Partitions: huge_app needed for esp32-camera + NimBLE + LittleFS ---
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# --- Bluetooth (NimBLE host, peripheral role + GATT for camera frames) ---
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_ROLE_OBSERVER=n

# --- Camera ---
CONFIG_CAMERA_CORE0=y
CONFIG_OV2640_SUPPORT=y

# --- Crypto for BTHome v2 AES-CCM ---
CONFIG_MBEDTLS_CCM_C=y
CONFIG_MBEDTLS_AES_C=y

# --- Filesystem on the onboard microSD ---
CONFIG_FATFS_LFN_HEAP=y
